temp1/src/Enums/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадач</name>
  <enumValues>
    <name>ктНеобработана</name>
  </enumValues>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ктНаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>ктСогласована</name>
  </enumValues>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

temp1/src/Enums/СтатусыЗадач/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	А = 1;
КонецПроцедуры

Функция ЭтоСтатусВыполненойЗадачи(Статус) Экспорт
	Возврат Статус = Перечисления.СтатусыЗадач.Завершена
			ИЛИ Статус = Перечисления.СтатусыЗадач.Отменена
			ИЛИ Статус = Перечисления.СтатусыЗадач.Подтверждение;
КонецФункции

Функция ЭтоСтатусЗакрытойЗадачи(Статус) Экспорт
	Возврат Статус = Перечисления.СтатусыЗадач.Завершена
			ИЛИ Статус = Перечисления.СтатусыЗадач.Отменена;
КонецФункции

Функция ЭтоСтатусОткрытойЗадачи(Статус) Экспорт
	Возврат Статус <> Перечисления.СтатусыЗадач.Завершена
			И Статус <> Перечисления.СтатусыЗадач.Отменена;
КонецФункции
